<?php
$html = '
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p  style="text-align:center;"><strong><font size="16">安智市场CPD推广合作协议</font></strong></p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>甲&nbsp;&nbsp;&nbsp;&nbsp;方：cpd_company<br />
地址：cpd_address<br />
电话：cpd_contact_phone<br />
联系人：cpd_contact_name<br /><br />
乙&nbsp;&nbsp;&nbsp;方：c_company<br />
地址：c_address<br />
电话：c_tel<br />
联系人：c_contact</p>
<p><b>&nbsp;&nbsp;</b>
甲方及其关联公司拥有优质的“softname    ”手机客户端软件（以下简称“甲方产品”），在手机客户端软件技术方面有较强的实力和丰富的经验。乙方利用其渠道（安智市场、安智代运营应用商店和安智地推团队）为甲方推广甲方产品,甲乙双方经友好协商，在平等互利的基础上，达成如下协议：</p>
<p><b>1合作内容</b><br>
<b>&nbsp;&nbsp;</b>
1.1甲方负责通过电子邮件，开发者后台上传、存储卡等方式，将甲方产品提交给乙方。乙方利用
<b>&nbsp;&nbsp;  </b>
其渠道，将甲方产品推广给手机用户使用并且联网。<br>
<b>&nbsp;&nbsp;</b>
1.2甲乙双方应相互配合，进行相关技术和内容的联调和测试，以确保甲方产品可以成功内置在乙
<b>&nbsp;&nbsp;  </b>
方渠道中，联调测试成功后，乙方可将甲方产品正式在其渠道中进行推广。</p><br>
<p><b>2合作方式及期限</b><br>
<b>&nbsp;&nbsp;</b>
2.1合作方式：乙方在合作期限内为甲方提供推广服务，乙方提供真实有效的数据统计，双方以此
<b>&nbsp;&nbsp;  </b>
为核算基础进行核对并结算。<br>
<b>&nbsp;&nbsp;</b>
2.2合作期限：自start_y年start_m月start_d至end_y年end_m月end_d止，合作期结束后，双方对合作效果均满意，
<b>&nbsp;&nbsp;  </b>
可以通过签署补充协议的方式延长合同期限。</p><br>
<p><b>3双方权利和义务</b><br>
<b>&nbsp;&nbsp;</b>
3.1甲方的权利和义务<br>
<b>&nbsp;&nbsp;&nbsp;</b>
3.1.1甲方负责其产品的合法性，并承担相应的法律责任。<br>
<b>&nbsp;&nbsp;&nbsp;</b>
3.1.2甲方提供的产品如涉及第三方权利，由甲方自行出资负责相关的版权事宜，与乙方无关。<br>
<b>&nbsp;&nbsp;&nbsp;</b>
3.1.3甲方在本合同期限内负责合作内容的平台建设，包括技术支持，内容产品支持等。<br>
<b>&nbsp;&nbsp;&nbsp;</b>
3.1.4甲方负责所推广产品的合法性，确保提供给乙方产品的稳定性，甲方负责维护所推广产品
<b>&nbsp;&nbsp;&nbsp;&nbsp; </b>
的内容。<br>
<b>&nbsp;&nbsp;&nbsp;</b>
3.1.5甲方负责甲方服务器设置、运营、维护管理以及用户管理，并承担相应产生的一切费用。<br>
<b>&nbsp;&nbsp;&nbsp;</b>
3.1.6乙方提供双方合作项目的数据统计支持，负责提供真实准确的数据统计。<br><br>
<b>&nbsp;&nbsp;</b>
3.2乙方的权利和义务<br>
<b>&nbsp;&nbsp;&nbsp;</b>
3.2.1乙方负责乙方自身推广体系的建立、运营。<br>
<b>&nbsp;&nbsp;&nbsp;</b>
3.2.2合作期间，如甲方有其他推广需求，需与乙方协商。<br>
<b>&nbsp;&nbsp;&nbsp;</b>
3.2.3乙方承诺并保证其有权在乙方渠道中推广甲方产品。<br>
<b>&nbsp;&nbsp;&nbsp;</b>
3.2.4乙方保证非经甲方事先书面同意，不对甲方产品进行反向工程(reverse engineer)、反向编
<b>&nbsp;&nbsp;&nbsp;&nbsp; </b>译(decompile)或反汇编(disassemble)，不得破坏其完整性(包括程序代码、数据等)，不得
<b>&nbsp;&nbsp;&nbsp;&nbsp; </b>
删除其上的有关甲方版权的说明或申明等信息。<br>
<b>&nbsp;&nbsp;&nbsp;</b>
3.2.5乙方保证非经甲方事先书面同意，不得为任何目的，以任何方式，有偿或无偿地将本协<br>
<span>&nbsp;&nbsp;&nbsp;&nbsp; </span>  
议下所获得的甲方产品向第三方出借、出租、转让或转授权，也不得以甲方产品为基础
<b>&nbsp;&nbsp;&nbsp;&nbsp; </b>
制作、销售、使用衍生产品。</p>
<p><b>4利益分配和结算方式</b><br>
<b>&nbsp;&nbsp;</b>
4.1结算标准如下：
甲方以N（下载量）× 单价（元）的标准向乙方进行结算推广费。<br>
<b>&nbsp;&nbsp;</b>
4.2结算方式：甲方在协议签订后5个工作日以内将推广费用打入乙方指定的如下账户，如遇国家法定节假日顺延。<br>
<b>&nbsp;&nbsp;</b>
4.3双方可以在协议的基础上，通过邮件或者补充协议的形式，来进行单价的调整。<br>
<b>&nbsp;&nbsp;&nbsp;</b>
<b>乙方账户信息：</b><br>
<b>&nbsp;&nbsp;&nbsp;</b>
开户名称：北京力天无限网络技术有限公司<br>
<b>&nbsp;&nbsp;&nbsp;</b>
开户银行：中国建设银行 北京分行 上地支行<br>
<b>&nbsp;&nbsp;&nbsp;</b>
账号：11001045300053010315<br></p>
<p><b>5保密条款</b><br>
<b>&nbsp;&nbsp;</b>
在合作过程中，一方必须对自另一方所获取的商业秘密严格保密，在未事先取得另一方书面同意的情况下，不得向任何第三方披露，同时保证因为工作需要接触商业秘密的该方员工严格保密，否则应承担对另一方因此而受到的损失，且该保密信息不因本合作协议的终止而终止。除本协议规定之工作所需外，未经对方事先同意，不得擅自使用、复制对方的商标、标志、商业信息、技术及其他资料。<br><br>
<b>6违约与终止</b><br>
<b>&nbsp;&nbsp;</b>
6.1如任何一方违反本协议所规定的义务，违约方在收到守约方要求纠正其违约行为的书面通知之
<b>&nbsp;&nbsp; </b>
日,应立即停止其违约行为,并在十(10)个工作日内赔偿守约方因此受到的所有损失。如违约方继
<b>&nbsp;&nbsp; </b>
续进行违约行为或不履行其义务,守约方除就其所有损失而获得违约方赔偿外,亦有权在违约方
<b>&nbsp;&nbsp; </b>
收到书面通知当日(收件日)终止本协议。<br>
<b>&nbsp;&nbsp;</b>
6.2除本协议另有规定，如甲方单方面提前终止本协议，需向乙方提前十(10)个工作日说明。<br>
<b>&nbsp;&nbsp;</b>
6.3甲方逾期付款的，每逾期一天，按照应付金额的1%向乙方支付违约金，超过1个月的，乙方有
<b>&nbsp;&nbsp; </b>
权解除合同。<br>
<b>&nbsp;&nbsp;</b>
6.4如果因为甲方产品版权或者其他问题而给乙方造成损失的，甲方应承担由此而给乙方造成的一
<b>&nbsp;&nbsp; </b>
切损失，此损失包括但不限于律师费、诉讼费、赔偿第三方的费用等。<br><br>
<b>7其他</b><br>
<b>&nbsp;&nbsp;</b>
7.1本协议一经签署，即具法律效力。<br>
<b>&nbsp;&nbsp;</b>
7.2本协议双方如有任何争议，应当本着诚实信用的原则友好协商解决，如协商不成需向乙方所在
<b>&nbsp;&nbsp; </b>
地的人民法院提请诉讼。<br>
<b>&nbsp;&nbsp;</b>
7.3本协议未尽事宜，双方协商后可另行签订补充协议，该补充协议作为本协议的一部分，与本协
<b>&nbsp;&nbsp; </b>
议享有同样的法律效力，同时，补充协议中与本协议有冲突的条款，以补充协议中规定的内容
<b>&nbsp;&nbsp; </b>
为准。</p>
';